Tested on latest TF and AWS Provider and this example now works. Confirmed fixed.

```sh
$ terraform -v                                                                                                                                    

Terraform v1.0.1
on linux_amd64
+ provider registry.terraform.io/hashicorp/aws v3.48.0
```

```
$ terraform plan --var-file=variables.tfvars                                                                                                      

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.mwe_dns[0] will be created
  + resource "aws_route53_record" "mwe_dns" {
      + allow_overwrite = false
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "mwe"
      + type            = "A"
      + zone_id         = "REDACTED"

      + alias {
          + evaluate_target_health = false
          + name                   = "REDACTED.cloudfront.net"
          + zone_id                = "REDACTED"
        }
    }

  # aws_route53_record.mwe_dns[1] will be created
  + resource "aws_route53_record" "mwe_dns" {
      + allow_overwrite = false
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "mwe"
      + type            = "AAAA"
      + zone_id         = "REDACTED"

      + alias {
          + evaluate_target_health = false
          + name                   = "REDACTED.cloudfront.net"
          + zone_id                = "REDACTED"
        }
    }

  # aws_route53_record.mwe_dns_extended will be created
  + resource "aws_route53_record" "mwe_dns_extended" {
      + allow_overwrite = false
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "extended_mwe"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "REDACTED"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
```